#include<stdio.h>
 
int main1(){
    //&:按位与：两个2进位都位1，结果位1，否则0
    //00000000 00000000 00000000 000010010
   //&00000000 00000000 00000000 00000101
    //00000000 00000000 00000000 00000001
    int a=9&5;
    printf("a=%d\n",a);
    //|:按位或：两个2进位有一个位为1，结果位1，否则0
    //00000000 00000000 00000000 00001001
   //|00000000 00000000 00000000 00000101
    //00000000 00000000 00000000 00001101
    int b=9|5;
    printf("b=%d\n",b);
    //~:按位取反：1就是0，0就是1
    int d=-6;
      //10000000 0000000 00000000 00000110
    //  11111111 1111111 11111111 11111010

    printf("~d=%d\n",~d);
    //^:按位异或：两个2进位不同时，结果位1，否则0
    int c=9^5;
    printf("c=%d\n",c);
    //<<n:左移：把整数的各个二进位全部左移n位，丢弃高位，低位以0来补.左移相当于乘以2的n次方
    printf("%d\n",9<<3);
    //>>n:右移：把整数的各个二进位全部右移n位，保存符号位不变，右移相当于除以2的n次方
    //为正数:符号位0，最高位补0
    //为负数:符号位1,最高位补0还是1取决于编译系统（Mac系统中用符号为补齐）
    printf("%d\n",-9>>1);
    //printf("%d\n",9>>33);--溢出（overflow）
    
    //10000000 00000000 00000000 00001001
    //111111111 11111111 11111111 1111011
    return 0;
}


int main(){
    int a=20,b=40;
    //异或具有二次还原性
    a=a^b;
    b=a^b;
    a=a^b;
    printf("a=%d,b=%d\n",a,b);
    return 0;
}


